Repository: eddyem/fitsmaniplib
Catalog: locale/*/*.po
Languages: ru

source: Amount of histogram levels should be less than 65536!
ru: Количество уровней гистограммы не должно превышать 65535!

source: Bottom fraction should be in [0, 1)
ru: Доля снизу должна быть в диапазоне [0, 1)

source: Can't add record to list
ru: Не могу добавить запись в список

source: Can't copy data
ru: Не могу скопировать данные

source: Can't create output image
ru: Не могу создать выходное изображение

source: Can't find bottom index
ru: Не могу найти нижний индекс

source: Can't get real path for %s, use cfitsio to rewrite
ru: Не могу определить путь (realpath) к %s, использую cfitsio для перезаписи

source: Can't read HDU
ru: Не могу прочесть HDU

source: Can't read column %d!
ru: Не могу прочесть столбец %d!

source: Can't write column %s!
ru: Не могу записать столбец %s!

source: Can't write table %s!
ru: Не могу записать таблицу %s!

source: Data range is too small
ru: Диапазон данных слишком мал

source: Found %d pixels with undefined value
ru: Найдено %d пикселей с неопределенными значениями

source: Given colormap doesn't support yet
ru: Данная палитра пока не поддерживается

source: Given transform type not supported yet
ru: Данный тип преобразований пока не поддерживается

source: No keywords in given HDU
ru: В данном HDU ключи отсутствуют

source: No pixels leave to process, have: %zd, need: %zd
ru: Не осталось пикселей для обработки, есть: %zd, требуется: %zd

source: Top fraction should be in (0, 1]
ru: Верхняя доля должна быть в диапазоне (0, 1]

source: Undefined image type, cant convert to double
ru: Неопределенный тип файла, не могу преобразовать в double

source: Unknown HDU type
ru: Неизвестный тип HDU

source: Wrong parameters
ru: Неправильные параметры

source: strdup() failed!
ru: Не удалось сделать strdup()!
